In [1]:
import numpy as np
import pandas as pd

In [2]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [3]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
string_data[0] = None
string_data

0         None
1    artichoke
2          NaN
3      avocado
dtype: object

In [5]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [6]:
from numpy import nan as NA

In [7]:
data = pd.Series([1, NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [8]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [9]:
data[data.isnull()]

1   NaN
3   NaN
dtype: float64

In [10]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [11]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA], [NA, NA, NA], [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [12]:
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [13]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [14]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [15]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [16]:
df = pd.DataFrame(np.random.randn(7,3))
df

          0         1         2
0 -0.303636 -0.339187 -0.428055
1 -0.069476 -1.221146  0.840903
2  0.211351 -0.076523  1.373635
3 -0.399436 -1.927148  0.560334
4 -0.853179  0.301922 -0.359999
5 -1.427942  0.557457  1.558445
6 -0.935898 -1.032424  0.731482

In [17]:
df.iloc[:4, 1] = NA

df.iloc[:2, 2] = NA

df

          0         1         2
0 -0.303636       NaN       NaN
1 -0.069476       NaN       NaN
2  0.211351       NaN  1.373635
3 -0.399436       NaN  0.560334
4 -0.853179  0.301922 -0.359999
5 -1.427942  0.557457  1.558445
6 -0.935898 -1.032424  0.731482

In [18]:
df.dropna(thresh=2)

          0         1         2
2  0.211351       NaN  1.373635
3 -0.399436       NaN  0.560334
4 -0.853179  0.301922 -0.359999
5 -1.427942  0.557457  1.558445
6 -0.935898 -1.032424  0.731482

In [19]:
df.dropna()

          0         1         2
4 -0.853179  0.301922 -0.359999
5 -1.427942  0.557457  1.558445
6 -0.935898 -1.032424  0.731482

In [20]:
df.fillna(0)

          0         1         2
0 -0.303636  0.000000  0.000000
1 -0.069476  0.000000  0.000000
2  0.211351  0.000000  1.373635
3 -0.399436  0.000000  0.560334
4 -0.853179  0.301922 -0.359999
5 -1.427942  0.557457  1.558445
6 -0.935898 -1.032424  0.731482

In [21]:
df.fillna({1: 0.5, 2: 0.0})

          0         1         2
0 -0.303636  0.500000  0.000000
1 -0.069476  0.500000  0.000000
2  0.211351  0.500000  1.373635
3 -0.399436  0.500000  0.560334
4 -0.853179  0.301922 -0.359999
5 -1.427942  0.557457  1.558445
6 -0.935898 -1.032424  0.731482

In [22]:
_ = df.fillna(0, inplace=True)

df

          0         1         2
0 -0.303636  0.000000  0.000000
1 -0.069476  0.000000  0.000000
2  0.211351  0.000000  1.373635
3 -0.399436  0.000000  0.560334
4 -0.853179  0.301922 -0.359999
5 -1.427942  0.557457  1.558445
6 -0.935898 -1.032424  0.731482

In [23]:
df = pd.DataFrame(np.random.randn(6,3))
df

          0         1         2
0 -0.378101  0.240351 -0.336127
1  1.430373 -0.878532  0.799937
2 -0.959008 -0.384281  1.295328
3  0.775661  0.227331 -0.068397
4 -1.461550  0.531427 -0.404307
5  0.631207 -0.066858 -2.068803

In [24]:
df.iloc[2:, 1] = NA

df.iloc[4:, 2] = NA

df

          0         1         2
0 -0.378101  0.240351 -0.336127
1  1.430373 -0.878532  0.799937
2 -0.959008       NaN  1.295328
3  0.775661       NaN -0.068397
4 -1.461550       NaN       NaN
5  0.631207       NaN       NaN

In [25]:
df.fillna(method='ffill')

          0         1         2
0 -0.378101  0.240351 -0.336127
1  1.430373 -0.878532  0.799937
2 -0.959008 -0.878532  1.295328
3  0.775661 -0.878532 -0.068397
4 -1.461550 -0.878532 -0.068397
5  0.631207 -0.878532 -0.068397

In [26]:
df.fillna(method='ffill', limit=2)

          0         1         2
0 -0.378101  0.240351 -0.336127
1  1.430373 -0.878532  0.799937
2 -0.959008 -0.878532  1.295328
3  0.775661 -0.878532 -0.068397
4 -1.461550       NaN -0.068397
5  0.631207       NaN -0.068397

In [27]:
data = pd.Series([1., NA, 3.5, NA, 7.])

data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [28]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                    'k2': [1, 1, 2, 3, 3, 4, 4]})

data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [29]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [30]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [31]:
data['v1'] = range(7)

data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [32]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [33]:
data.drop_duplicates(['k1', 'k2'])

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5

In [34]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [35]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [36]:
meat_to_animal = {
  'bacon': 'pig',
  'pulled pork': 'pig',
  'pastrami': 'cow',
  'corned beef': 'cow',
  'honey ham': 'pig',
  'nova lox': 'salmon'
}

In [37]:
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [38]:
data['animal'] = lowercased.map(meat_to_animal)

data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [39]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [40]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

data.replace(-999, NA)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [41]:
data.replace([-999, -1000], NA)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [42]:
data.replace([-999, -1000], [1,0])

0    1.0
1    1.0
2    2.0
3    1.0
4    0.0
5    3.0
dtype: float64

In [43]:
data.replace({-999: NA, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64